

@echo off

setlocal


:LOOP

set HOUR=%time:~0,2%
set MINUTE=%time:~3,2%
set MINUTE_SUM=0
set YN=0
set NUM=0
set WORK=0

set HOUR=%time:~0,2%
set MINUTE=%time:~3,2%

title 귀차니즘 1.2
color 1F

REM mode con cols=35 lines=30



rem 초중말번 사진폴더 선택 후 이동위한 시간을 분으로 계산
REM 시간을 분단위로 환산하여 근무시간 특정
rem 초번 06:41~14:40 ---> 401~880분
rem 중번 14:41~22:40 ---> 881~1360분
rem 말번 22:41~06:40 ---> 1361~1440분, 익일 1~400분

REM 말번은 2의 시간대(날짜)로 나뉘기 때문에 어제날짜를 구하는 코드 삽입
REM 01일 의 어제는 31일, 30일, 윤달의 29일, 28일이 될 수 있고 또는 년도, 월이 바뀌기 때문

REM TIMEOUT /T 1

set /a MINUTE_SUM=(%HOUR% * 60) + %MINUTE%

REM 근무시간 선택 테스트용 set /a MINUTE_SUM=1400



rem 글자색 color e

ECHO.

echo =======================
echo %date:~0,4%년 %date:~5,2%월 %date:~8,2%일
echo 새로고침 시간 : %HOUR% : %MINUTE%
ECHO MINUTE_SUM : %MINUTE_SUM%
echo 귀차니즘 v1.2 (2011~%date:~0,4%)
echo =======================
rem echo    111. 출 근
echo =======================
echo    1. 사 고 사 진
echo =======================
echo    2. 사 고 속 보
echo =======================
echo    3. 사 고 도 면
echo =======================
echo    4. 일일교통상황
echo      - 44. 일지 복사용
echo =======================
echo    5. 견인서비스 사진
echo =======================
echo    6. 견인서비스 도면
echo =======================
echo    7. 패트롤 돌발
echo =======================
echo    8. 247서버(영상)
echo      - 88. 247서버(캡쳐)
echo =======================
echo    9. 민원
echo =======================
echo   10. 인수인계부
echo =======================
REM echo 초중말번 선택 테스트용 %MINUTE_SUM%
REM echo (현재시간 * 60) + 현재 분)
echo =======================



set /p Num=번호입력 후 엔터: 

ECHO.
ECHO.
ECHO.

if %Num% == 111 goto GOTOWORK 
if %Num% == 1 goto SAGOSAJIN
if %Num% == 2 goto SOKBO
if %Num% == 3 goto Photomount
if %Num% == 4 goto EXISTING
if %Num% == 44 goto EXISTING_COPY
if %Num% == 5 goto SERVICE_SAJIN
if %Num% == 6 goto SERVICE_Photomount
if %Num% == 7 goto PATROL
if %Num% == 8 goto 247SERVER
if %Num% == 88 goto 247SERVER_IMG
if %Num% == 9 goto MINWON
if %Num% == 10 goto INSU


if %Num% GTR 10 goto LOOP
if %Num% LSS 1 goto LOOP





REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼ 111. 출 근 ▼=======

:GOTOWORK 
	
	set WORK=1	

	goto SAGOSAJIN


:GOTOWORK_IF 


	goto EXISTING




REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼ 1. 사고사진 ▼=======

:SAGOSAJIN

rem 초번 06:41~14:40 ---> 401~880분
rem 중번 14:41~22:40 ---> 881~1360분
rem 말번 22:41~06:40 ---> 1361~1440분, 익일 1~400분


	IF %MINUTE_SUM% GEQ 401 (
rem				ECHO 초번 IF 스치고
rem				ECHO.
				GOTO SAGOSAJIN_CHO

	) ELSE ( 
		ECHO.
rem		ECHO 말번 IF 스치고
	 	GOTO SAGOSAJIN_MAL
	)
	


:SAGOSAJIN_CHO

	IF %MINUTE_SUM% LEQ 880 (

			ECHO 지금은 초번
			ECHO.

			IF EXIST "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\1-초번자료\" ( 
				ECHO 오늘 날짜 초번 사진폴더 오픈
				%SystemRoot%\explorer.exe "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\1-초번자료"

				IF %WORK%==1 ( 
					goto GOTOWORK_IF
				) ELSE (				
					goto LOOP
				) 

			) ELSE ( 

				ECHO.
				ECHO ================================
				ECHO 오늘 초번 사진폴더 없음
				ECHO ================================

				ECHO 초번 사진폴더를 만듭니다.
				TIMEOUT /T 1
				MKDIR "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\1-초번자료"
				MKDIR "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\1-초번자료\공사장 사진"
				MKDIR "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\1-초번자료\동대구TG 광장부 불법주정차"
				TIMEOUT /T 2
				%SystemRoot%\explorer.exe "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\1-초번자료"

				goto LOOP

			)

	)ELSE (
		GOTO SAGOSAJIN_JUNG
	)


:SAGOSAJIN_JUNG

	IF %MINUTE_SUM% LEQ 1360 ( 

			ECHO 지금은 중번
			ECHO.
			IF EXIST "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\2-중번자료\" ( 
				ECHO 오늘 날짜 중번 사진폴더 오픈
				%SystemRoot%\explorer.exe "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\2-중번자료"
				goto LOOP
			) ELSE ( 

				ECHO.
				ECHO ================================
				ECHO 오늘 중번 사진폴더 없음
				ECHO ================================

				ECHO 중번 사진폴더를 만듭니다.
				TIMEOUT /T 1
				MKDIR "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\2-중번자료"
				MKDIR "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\2-중번자료\동대구TG 광장부 불법주정차"
				TIMEOUT /T 2
				%SystemRoot%\explorer.exe "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\2-중번자료"

				goto LOOP

			)


	)ELSE (
		GOTO SAGOSAJIN_MAL
	)


:SAGOSAJIN_MAL 



IF %MINUTE_SUM% GEQ 1361 (

	IF EXIST "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\3-말번자료\" (
		
		set /a DATE1=%date:~8,2%	
		ECHO 지금은 %date:~8,1%%DATE1%일 말번
		ECHO.

				ECHO %date:~8,1%%DATE1%일 말번 사진폴더 오픈
				%SystemRoot%\explorer.exe "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\3-말번자료"
		  		goto LOOP	
				
	) ELSE (

		REM // 폴더가 없으면 만들고 폴더를 열어 줌.

				ECHO.
				ECHO ================================

				ECHO 현재 %date:~8,2%%DATE1%일의 말번 사진폴더 없음
				ECHO ================================

				ECHO 말번 사진폴더를 만듭니다.
				TIMEOUT /T 1
				MKDIR "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\3-말번자료"
				MKDIR "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\3-말번자료\동대구TG 광장부 불법주정차"
				TIMEOUT /T 2
				%SystemRoot%\explorer.exe "z:\1. 사진자료\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\3-말번자료"

				goto LOOP
	)
) ELSE IF %MINUTE_SUM% LEQ 400 (
	
	SET YESTERDAY_CHOICE=SAGOSAJIN_MAL_YESTERDAY_DIR

	GOTO YESTERDAY
	
)



:SAGOSAJIN_MAL_YESTERDAY_DIR

REM 어제 날짜를 YESTERDAY에서 계산 해서 이쪽으로 땡기와가꼬 폴더를 오픈하도록 변수를 넘겨 줌
REM 일, 월, 년, 윤년, 윤달까지 계산되는 코드 임(구글링으로 땡겨서 일부수정).

	ECHO 현재 %date:~0,4%-%date:~5,2%-%date:~8,2%
	ECHO 날짜가 바뀌어서
rem	ECHO 말번 사진 폴더
	ECHO %YY%-%MM%-%DD% 오픈
REM                     2020    01     01 요렇게 각각 저장 되어있음

	IF EXIST "z:\1. 사진자료\%YY%년\%MM%월\%DD%일\3-말번자료\" (

			%SystemRoot%\explorer.exe "z:\1. 사진자료\%YY%년\%MM%월\%DD%일\3-말번자료"
								REM ↑ 이것은 다른 코드의 변수와 달리 말번 근무 중 다음날이 되면 어제날짜를 알아내서 열어 줌
	  		goto LOOP
	)ELSE (

		REM // 폴더가 없으면 만들 수 있도록 물어 봄

				ECHO.
				ECHO ================================
				ECHO 현재 %date:~8,1%%DATE1%일의 말번 사진폴더 없음
				ECHO ================================
				ECHO 말번 사진폴더를 만듭니다.

rem				TIMEOUT /T 1
rem				MKDIR "z:\1. 사진자료\%YY%년\%MM%월\%DD%일\3-말번자료"
rem				TIMEOUT /T 2
rem				%SystemRoot%\explorer.exe "z:\1. 사진자료\%YY%년\%MM%월\%DD%일\3-말번자료"

				goto LOOP

	)





REM 폴더이름에 공백이 있으면 " " 를 씌워야 하나 봄


REM =================================================================================================================
REM =================================================================================================================

	






REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼2. 사고속보 ▼=======

:SOKBO

	%SystemRoot%\explorer.exe "Z:\2. 사고속보\%date:~0,4%년\%date:~5,2%월"
	
	goto LOOP

REM =================================================================================================================
REM =================================================================================================================







REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼3. 사고도면 ▼=======


:Photomount

	%SystemRoot%\explorer.exe "Z:\4. 사고도면\%date:~0,4%년\%date:~5,2%월"
	
	goto LOOP

REM =================================================================================================================
REM =================================================================================================================







REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼4. 일일교통상황일지 ▼=======


:EXISTING

	IF %MINUTE_SUM% GEQ 401 (

		IF EXIST "Z:\18.일일교통상황\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\" ( 

				%SystemRoot%\explorer.exe "Z:\18.일일교통상황\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\"

REM				IF EXIST "Z:\18.일일교통상황\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\%date:~2,2%%date:~5,2%%date:~8,2%_일일교통현황_초번.HWP" ( 
REM					 "Z:\18.일일교통상황\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\%date:~2,2%%date:~5,2%%date:~8,2%_일일교통현황_초번.HWP"
REM				) ELSE (
REM					COPY "D:\K00\내 참고\1 일일교통상황일지 복사용\210101_일일교통현황_초번.HWP"  "Z:\18.일일교통상황\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일\*.*"
REM				) 
		  		goto LOOP

		)ELSE ( 

			REM 창이 꺼지는 현상 발생으로 귀차니즘 1.3에서 폴더 생성할지 선택 할 수 있도록 할 예정 임.

				ECHO.
				ECHO ▶ 폴더가 없어서 생성 중.....
				TIMEOUT /T 1
				MKDIR "Z:\18.일일교통상황\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일"
				TIMEOUT /T 2
				%SystemRoot%\explorer.exe "Z:\18.일일교통상황\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일"

				goto LOOP
		)

	)ELSE ( 

		SET YESTERDAY_CHOICE=EXISTING_YESTERDAY_DIR

		GOTO YESTERDAY

	)

REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼44. 일일교통상황일지 새로만들기 복사용 ▼=======

:EXISTING_COPY

	%SystemRoot%\explorer.exe "D:\K00\내 참고\1 일일교통상황일지 복사용"

	goto LOOP



:EXISTING_YESTERDAY_DIR

	ECHO 현재날짜는 %date:~0,4%년 %date:~5,2%월 %date:~8,2%일
	ECHO 날짜가 바뀌어서
	ECHO 일일교통상황일지 폴더= %YY%년 %MM%월 %DD%일 오픈


		IF EXIST "Z:\18.일일교통상황\%YY%년\%MM%월\%DD%일\" (

				%SystemRoot%\explorer.exe "Z:\18.일일교통상황\%YY%년\%MM%월\%DD%일"
		  		goto LOOP
		)ELSE (

			REM // 폴더가 없으면 만들 수 있도록 물어 봄

				ECHO.
				ECHO ================================

				ECHO 현재 %date:~8,1%%DATE1%일의 일일교통상황일지 폴더 없음
				ECHO ================================

				set /p YN=오늘의 일일교통상황일지 폴더 생성은 1 입력 후 엔터 : 

				ECHO 일일교통상황일지폴더를 만듭니다.(보류 중 알아서 만드세요)
					TIMEOUT /T 1
REM					MKDIR "z:\Z:\18.일일교통상황\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일"
					TIMEOUT /T 2
REM					%SystemRoot%\explorer.exe "Z:\18.일일교통상황\%date:~0,4%년\%date:~5,2%월\%date:~8,2%일"
				)

				goto LOOP
		)



REM =================================================================================================================
REM =================================================================================================================








REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼5. 견인서비스 사진 ▼=======


:SERVICE_SAJIN

	%SystemRoot%\explorer.exe "Z:\9. 견인서비스\사진\%date:~0,4%년\%date:~5,2%월"

	goto LOOP

REM =================================================================================================================
REM =================================================================================================================






REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼6. 견인서비스 도면 ▼=======


:SERVICE_Photomount

	%SystemRoot%\explorer.exe "Z:\9. 견인서비스\사진대지\%date:~0,4%년\%date:~5,2%월"

	goto LOOP

REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼7. 패트롤돌발 ▼=======

:PATROL

	"Z:\10. 패트롤 돌발상황 대장\%date:~0,4%년 패트롤(돌발상황) 운영대장.xlsx"

	goto LOOP

REM =================================================================================================================
REM =================================================================================================================







REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼8. 247서버(영상) ,  88 247서버(캡쳐)▼=======

:247SERVER

	%SystemRoot%\explorer.exe "\\192.168.19.247\c$\백업\1. 동영상\%date:~0,4%년"
        
	goto LOOP 

:247SERVER_IMG

	%SystemRoot%\explorer.exe "\\192.168.19.247\c$\백업\2. 캡쳐(사진자료)"

	goto LOOP

REM =================================================================================================================
REM =================================================================================================================




REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼9. 민원 ▼=======

:MINWON

	"Z:\14.민원(한글)\민원(%date:~0,4%년).hwp"

	goto LOOP

REM =================================================================================================================
REM =================================================================================================================



REM =========================================================================================================================
REM =========================================================================================================================
REM =======▼10. 인수인계부 ▼=======

:INSU

	"Z:\20.인수인계부\인수인계부(%date:~2,2%년).xlsx"

	goto LOOP

REM =================================================================================================================
REM =================================================================================================================





REM==YESTERDAY==== ↓↓↓ 어제 날짜가 필요하면 여기를 호출 ↓↓↓ ====YESTERDAY======YESTERDAY=======YESTERDAY==========


:YESTERDAY
	for /f "tokens=1-3 delims=- " %%A in ('echo %DATE%') do (set YY=%%A&SET MM=%%B&SET DD=%%C)

		REM 요고는 다 이해 못함


	set /a DD=1%DD%-101

	set /a MM=1%MM%-100

rem	echo %MM%월, %DD%일
	
	if %DD% GTR 0 goto YESTERDAY_end

	set /a MM=%MM%-1

rem	echo %MM%월, %DD%일

	if %MM% GTR 0 goto leap


	set /a DD=31
	set /a MM=12
	set /a YY=%YY%-1

	goto YESTERDAY_end	


:leap

rem 윤년계산, 올해를 4로 나눠서 소수점이 없으면 윤년임
	set /a TT=%YY%/4
	set /a TT=%TT%*4

rem	echo leap에 도착, 어제 계산중 (TT = %TT%, %YY%년, %MM%월, %DD%일)

	if not %YY% equ %TT% goto mon%MM%

	if %MM% equ 2 goto mon21 

	goto YESTERDAY_end



:mon1

:mon3

:mon5

:mon7

:mon8

:mon10

:mon12

	set /a DD=31 

rem	echo 31일인 월 도착

	goto YESTERDAY_end



:mon2

	set /a DD=28

	goto YESTERDAY_end



:mon21

	set /a DD=29

	goto YESTERDAY_end



:mon4

:mon6

:mon9

:mon11

	set /a DD=30

	goto YESTERDAY_end



:YESTERDAY_end

	set /a DD=%DD% + 100
	set DD=%DD:~1,2%
	set /a MM=%MM% + 100
	set MM=%MM:~1,2%
	SET AA=0
	SET BB=0
	SET CC=0
	SET FF=0



	REM 어제 날짜를 구해가꼬 요청한 함수로 이동 함.

	GOTO %YESTERDAY_CHOICE%


REM==YESTERDAY==== ↑↑↑ 어제 날짜가 필요하면 여기를 호출 ↑↑↑ ====YESTERDAY======YESTERDAY=======YESTERDAY==========


pause





